'use stict';
const pokemon = require('./pokemon');
const assert = require('assert');
// const chai = require('chai');
// Напишите тесты на метод show класса Pokemon;
// проверить что передается
describe('PokemonTest', () => {
  it('', () => {
    
  });
});


// Напишите тесты на метод add класса PokemonList;
// проверить что создается покемон и что размер массива увеличился


// Напишите тесты на метод show класса PokemonList;
// проверить, что в this массив и что у элемента вызванного есть метод show



// Напишите тесты на метод max класса PokemonList;
// в this лежат числа, убедиться, что возвращает наибольшее  в strongestPokemon, 
// если массив из одного числа вернет его, если массив пустой - ошибка

// При написании тестов грамотно организовывайте тесты 
// по файлам и наборам. И максимально используйте хуки, и другие возможности Mocha, чтобы тесты соответствовали принципу DRY.